primat2/lab2/lab2.tex
% Created 2023-03-17 Fri 14:36
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[T2A]{fontenc}
\usepackage{parskip}
\usepackage[margin=0.5in]{geometry}
\usepackage{enumerate}
\usepackage{nopageno}
\author{megabluejay}
\date{}
\title{}
\hypersetup{
 pdfauthor={megabluejay},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\begin{center}
\textbf{Лабораторная 2}

Моисеев M33001, Муров M33011
\end{center}

\section*{Вариант 1}
\label{sec:org8fcd196}

Две конкурирующие крупные торговые фирмы \(F_1\) и \(F_2\), планируют построить в одном из четырех небольших городов \(G_1\), \(G_2\), \(G_3\), \(G_4\), лежащих вдоль автомагистрали, по одному универсаму.

\begin{table}[htbp]
\label{data1}
\centering
\begin{tabular}{lrrrr}
 & \(G_1\) & \(G_2\) & \(G_3\) & \(G_4\)\\[0pt]
\hline
км & 0 & 30 & 40 & 150\\[0pt]
тыс & 30 & 50 & 40 & 30\\[0pt]
\end{tabular}
\end{table}


Доход определяется численностью населения городов и степенью удаленности.

Пусть \(d_j^i\) - расстояния от магазина \(j\) фирмы до \(i\) города

При \(d_1^i < d_2^i\) \(F_1\) получает 75\%
При \(d_1^i = d_2^i\) 60\%
При \(d_1^i > d_2^i\) 45\%

Матрица игры:

\begin{minted}[]{python}
ds, pops = data

def f(i, j, k):
    di, dj = abs(ds[i] - ds[k]), abs(ds[j] - ds[k])
    if di < dj:
        return 0.75
    elif di == dj:
        return 0.6
    else:
        return 0.45

[[sum(pops[k] * f(i, j, k) for k in range(4)) for j in range(4)] for i in range(4)]
\end{minted}

\(\begin{pmatrix}
 90.0 & 76.5 & 76.5 & 103.5 \\[0pt]
 103.5 & 90.0 & 91.5 & 103.5 \\[0pt]
 103.5 & 88.5 & 90.0 & 103.5 \\[0pt]
 76.5 & 76.5 & 76.5 & 90.0 \\[0pt]
\end{pmatrix}
\)

У нее есть седловая точка:

\begin{minted}[]{python}
max(map(min, matrix)), min(max(matrix[i][j] for i in range(4)) for j in range(4))
\end{minted}

\begin{center}
\begin{tabular}{rr}
90.0 & 90.0\\[0pt]
\end{tabular}
\end{center}

Оптимально обеим фирмам строить в \(G_2\)

\section*{Вариант 2}
\label{sec:org7a74084}

Двум погрузчикам разной мощности за 24 часа нужно погрузить на первой площадке 230 т, на второй - 68 т. Первый погрузчик
на 1-ой площадке может погрузить 10 т в час, а на 2-ой - 12 т в час. Второй погрузчик на каждой площадке может погрузить
по 13 т в час. Стоимость работ, связанных с погрузкой 1 т первым погрузчиком на первой площадке 8 руб., на второй - 7
руб., вторым погрузчиком на первой площадке - 12 руб., на второй - 13 руб. Нужно найти, какой объем работ должен
выполнить каждый погрузчик на каждой площадке, чтобы стоимость всех работ по погрузке была минимальной.

Обозначим \(x_1, x_2, x_3, x_4\) - времена работ погрузчиков в часах- 1 на 1 площадке, 1 на 2 площадке, 2 на 1 площаке, и 2 на 2 площадке

Условие в этом не четко, но будем считать, что погрузчики не могут работать одновременно.

Тогда \(8 \cdot 10 x_1 + 12 \cdot 13 x_3 + 7 \cdot 12 x_2 + 13 \cdot 13 x_4 \rightarrow \min\)

\begin{cases}
10 x_1 + 13 x_3 = 230 \\
12 x_2 + 13 x_4 = 68 \\
x_1 + x_2 + x_3 + x_4 \leq 24 \\
x_1, x_2, x_3, x_4 \geq 0
\end{cases}

Решаем симлекс методом

\begin{minted}[]{python}
ans = solve1(
    n=4,
    objective=8 * 10 * x1 + 12 * 13 * x3 + 7 * 12 * x2 + 13 * 13 * x4,
    constraints=[
        10 * x1 + 13 * x3 - 230,
        12 * x2 + 13 * x4 - 68,
        x1 + x2 + x3 + x4 <= 24
    ],
    direction="min"
)
[round(t, 5) for t in ans]
\end{minted}

\begin{center}
\begin{tabular}{rrrr}
2.77778 & 5.66667 & 15.55556 & 0.0\\[0pt]
\end{tabular}
\end{center}

Объем работ:

\begin{minted}[]{python}
[round(t * x, 3) for t, x in zip(ans, [10, 13, 12, 13])]
\end{minted}

\begin{center}
\begin{tabular}{rrrr}
27.778 & 73.667 & 186.667 & 0.0\\[0pt]
\end{tabular}
\end{center}


\section*{Вариант 6}
\label{sec:org0719cda}

\begin{center}
\begin{tabular}{rrrr}
7 & 2 & 5 & 1\\[0pt]
2 & 2 & 3 & 4\\[0pt]
5 & 3 & 4 & 4\\[0pt]
3 & 2 & 1 & 6\\[0pt]
\end{tabular}
\end{center}

Упростим матрицу, используя доминирующие строки и столбцы

\begin{table}[htbp]
\label{matrix6}
\centering
\begin{tabular}{rrr}
7 & 5 & 1\\[0pt]
2 & 3 & 4\\[0pt]
3 & 1 & 6\\[0pt]
\end{tabular}
\end{table}

\begin{minted}[]{python}
min(map(max, matrix)), max(min(matrix[i][j] for i in range(3)) for j in range(3))
\end{minted}

\begin{center}
\begin{tabular}{rr}
4 & 2\\[0pt]
\end{tabular}
\end{center}

Седловой точки нет

Составим систему для ЛП

\(x_1 + x_2 + x_3 \rightarrow \max\)

\begin{cases}
7 x_1 + 2 x_2 + 3 x_3 \leq 1 \\
5 x_1 + 3 x_2 + x_3 \leq 1 \\
x_1 + 4 x_2 + 6 x_3 \leq 1
\end{cases}

Решаем ее

\begin{minted}[]{python}
solve1(
    n=3,
    objective=x1 + x2 + x3,
    constraints=[
        7 * x1 + 2 * x2 + 3 * x3 <= 1,
        5 * x1 + 3 * x2 + x3  <= 1,
        x1 + 4 * x2 + 6 * x3 <= 1,
    ],
    direction="max",
)
\end{minted}

\begin{center}
\begin{tabular}{rrr}
0.07692308 & 0.1978022 & 0.02197802\\[0pt]
\end{tabular}
\end{center}

Стратегия первого игрока:

\begin{minted}[]{python}
total = sum(sol)
[round(x / total, 3) for x in sol]
\end{minted}

\begin{center}
\begin{tabular}{rrr}
0.259 & 0.667 & 0.074\\[0pt]
\end{tabular}
\end{center}

Для второго игрока:

\begin{minted}[]{python}
sol = solve1(
    n=3,
    objective=x1 + x2 + x3,
    constraints=[
        7 * x1 + 5 * x2 + x3 >= 1,
        2 * x1 + 3 * x2 + 4 * x3  >= 1,
        3 * x1 + x2 + 6 * x3 >= 1,
    ],
    direction="min",
)
[round(x /sol.sum(), 3) for x in sol]
\end{minted}

\begin{center}
\begin{tabular}{rrr}
0.074 & 0.481 & 0.444\\[0pt]
\end{tabular}
\end{center}

Математическое ожидание проигрыша первого игрока:

\begin{minted}[]{python}
round(sum(matrix[i][j] * ans1[i] * ans2[j] for i in range(3) for j in range(3)), 3)
\end{minted}

\begin{verbatim}
3.367
\end{verbatim}


\section*{Вариант 7}
\label{sec:org548ca76}

Платежная матрица:

\(\begin{pmatrix}
 1 & -1 & -1 \\[0pt]
 -1 & -1 & 3 \\[0pt]
 -1 & 2 & -1 \\[0pt]
\end{pmatrix}
\)

Стратегии:

\(\begin{pmatrix}
 6 / 13 & 3 / 13 & 4 / 13 \\[0pt]
 6 / 13 & 4 / 13 & 3 / 13 \\[0pt]
\end{pmatrix}
\)

\begin{minted}[]{python}
strat1, strat2 = strat
round(sum(strat1[i] * sum(matrix[i][j] * strat2[j] for j in range(3)) for i in range(3)), 3)
\end{minted}

\begin{verbatim}
-0.077
\end{verbatim}

\section*{Вариант 8}
\label{sec:org1debf42}

\(x_1 + x_2 \rightarrow \min\)

\begin{cases}
7 x_1 + 2 x_2 \geq 1 \\
x_1 + 11 x_2 \geq 1 \\
x_1, x_2 \geq 0
\end{cases}

Пусть

\begin{cases}
x_1 = \frac{x}{v} \\
x_2 = \frac{1 - x}{v}
\end{cases}

Тогда задачу можно записать как

\(v = \frac{1}{x_1 + x_2} \rightarrow max\)

\begin{cases}
7 x + 2 (1 - x) \geq v \\
x + 11 (1 - x) \geq v \\
1 \geq x \geq 0
\end{cases}

Если рассматривать \(x\), как вероятность выбора 1м игроком 1й стратегии, а каждую строку как случай чистой стратегии 2го игрока,
это соответствует матричной игре

\(\begin{pmatrix}
 7 & 1 \\[0pt]
 2 & 11 \\[0pt]
\end{pmatrix}
\)

\section*{Вариант 9}
\label{sec:org539c325}

Матрица игры:

\begin{center}
\begin{tabular}{rrrr}
7 & 2 & 5 & 1\\[0pt]
2 & 2 & 3 & 4\\[0pt]
5 & 3 & 4 & 4\\[0pt]
3 & 2 & 1 & 6\\[0pt]
\end{tabular}
\end{center}
\end{document}